In [1]:
import pandas as pd

In [2]:
csv_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.csv'
df = pd.read_csv(csv_path)

In [10]:
x = df[['Length']]
x.head(2)

    Length
0  0:42:19
1  0:42:11

In [9]:
# Get the column as a series

x = df['Length']
x

0    0:42:19
1    0:42:11
2    0:42:49
3    0:57:44
4    0:46:33
5    0:43:08
6    1:15:54
7    0:40:01
Name: Length, dtype: object

In [5]:
# Get the column as a dataframe

x = type(df[['Artist']])
x

pandas.core.frame.DataFrame

In [7]:
y = df[['Artist','Length','Genre']]
y.head(2)

            Artist   Length           Genre
0  Michael Jackson  0:42:19  pop, rock, R&B
1            AC/DC  0:42:11       hard rock

In [12]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'Michael Jackson'

In [13]:
df.loc[0, 'Artist']

'Michael Jackson'

In [14]:
df.iloc[0:2, 0:3]

            Artist          Album  Released
0  Michael Jackson       Thriller      1982
1            AC/DC  Back in Black      1980

In [15]:
df.loc[0:2, 'Artist':'Released']

            Artist                      Album  Released
0  Michael Jackson                   Thriller      1982
1            AC/DC              Back in Black      1980
2       Pink Floyd  The Dark Side of the Moon      1973